Tutoriels/interFoam/debitFranchissement/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{

    alpha            alpha.water;

    waveModel        irregularMultiDirectional;

    nPaddle          1;

    rampTime         2.0;

    activeAbsorption no;

    wavePeriods
    1000
    (
(2.468260053622327)
(2.4645827529729063)
(2.460916393167147)
(2.4572609254501607)
(2.453616301356314)
(2.4499824727070854)
(2.446359391608943)
(2.44274701045124)
(2.4391452819041293)
(2.4355541589164957)
(2.4319735947139094)
(2.428403542796591)
(2.424843956937403)
(2.4212947911798524)
(2.4177559998361113)
(2.4142275374850612)
(2.4107093589703443)
(2.407201419398441)
(2.4037036741367572)
(2.400216078811735)
(2.3967385893069735)
(2.3932711617613696)
(2.3898137525672736)
(2.386366318368661)
(2.3829288160593207)
(2.3795012027810594)
(2.3760834359219167)
(2.3726754731144037)
(2.3692772722337487)
(2.3658887913961646)
(2.362509988957126)
(2.359140823509664)
(2.355781253882674)
(2.35243123913924)
(2.3490907385749704)
(2.345759711716351)
(2.342438118319108)
(2.339125918366589)
(2.3358230720681576)
(2.332529539857595)
(2.329245282391526)
(2.325970260547847)
(2.3227044354241775)
(2.3194477683363153)
(2.316200220816712)
(2.312961754612958)
(2.309732331686279)
(2.306511914210048)
(2.30330046456831)
(2.3000979453543127)
(2.2969043193690593)
(2.2937195496198637)
(2.2905435993189265)
(2.287376431881915)
(2.284218010926561)
(2.2810683002712655)
(2.277927263933718)
(2.274794866129527)
(2.2716710712708608)
(2.2685558439650975)
(2.2654491490134925)
(2.262350951409849)
(2.2592612163392056)
(2.2561799091765304)
(2.253106995485429)
(2.2500424410168613)
(2.2469862117078687)
(2.2439382736803113)
(2.240898593239619)
(2.2378671368735463)
(2.234843871250942)
(2.23182876322053)
(2.2288217798096928)
(2.225822888223275)
(2.2228320558423853)
(2.219849250223219)
(2.216874439095882)
(2.213907590363228)
(2.2109486720997027)
(2.207997652550202)
(2.205054500128931)
(2.2021191834182816)
(2.199191671167713)
(2.1962719322926416)
(2.1933599358733424)
(2.1904556511538558)
(2.1875590475409075)
(2.184670094602831)
(2.1817887620685044)
(2.178915019826292)
(2.1760488379229956)
(2.173190186562813)
(2.1703390361063084)
(2.1674953570693822)
(2.1646591201222627)
(2.161830296088489)
(2.1590088559439184)
(2.156194770815729)
...
    );

    waveHeights
    1000
    (
(0.002400396103713195)
(0.002424822405030631)
(0.0024492590580374)
(0.0024737036108598816)
(0.0024981536274085504)
(0.0025226066878686333)
(0.002547060389175591)
(0.002571512345475698)
(0.0025959601885716605)
(0.0026204015683534776)
(0.002644834153214602)
(0.002669255630453584)
(0.0026936637066612085)
(0.002718056108093424)
(0.0027424305810300116)
(0.0027667848921193116)
(0.0027911168287090187)
(0.0028154241991632874)
(0.002839704833166262)
(0.002863956582012185)
(0.002888177318882291)
(0.002912364939108634)
(0.0029365173604249855)
(0.002960632523205027)
(0.002984708390688013)
(0.003008742949192039)
(0.003032734208315178)
(0.003056680201124555)
(0.003080578984333706)
(0.003104428638468234)
(0.0031282272680201112)
(0.0031519730015907134)
(0.0031756639920228424)
(0.0031992984165218866)
(0.003222874476766376)
(0.0032463903990080454)
(0.0032698444341617053)
(0.0032932348578850077)
(0.003316559970648417)
(0.003339818097795503)
(0.003363007589593765)
(0.0033861268212762577)
(0.0034091741930740898)
(0.0034321481302401415)
(0.003455047083064061)
(0.0034778695268788385)
(0.0035006139620590844)
(0.003523278914011261)
(0.0035458629331560107)
(0.0035683645949028306)
(0.00359078249961721)
(0.0036131152725805147)
(0.003635361563942703)
(0.0036575200486681607)
(0.003679589426474783)
(0.0037015684217664604)
(0.0037234557835592397)
(0.003745250285401291)
(0.003766950725286807)
(0.0037885559255641217)
(0.0038100647328381397)
(0.0038314760178672644)
(0.003852788675455064)
(0.003874001624336694)
(0.0038951138070604514)
(0.0039161241898644)
(0.003937031762548433)
(0.003957835538341784)
(0.003978534553766236)
(0.003999127868495113)
(0.00401961456520831)
(0.004039993749443358)
(0.004060264549442865)
(0.004080426115998285)
(0.004100477622290324)
(0.0041204182637260165)
(0.004140247257772644)
(0.004159963843788678)
(0.004179567282851791)
(0.004199056857584161)
(0.004218431871975134)
(0.004237691651201412)
(0.00425683554144484)
(0.0042758629097080225)
(0.004294773143627722)
(0.004313565651286354)
(0.004332239861021496)
(0.004350795221233713)
(0.004369231200192642)
(0.0043875472858415756)
(0.004405742985600576)
(0.004423817826168224)
(0.004441771353322163)
(0.00445960313171849)
(0.004477312744690069)
(0.004494899794043928)
(0.004512363899857789)
(0.0045297047002758085)
...
    );

    wavePhases
    1000
    (
(2.3173655123952956)
(3.4026450909576984)
(1.1854912855333268)
(3.9303298435216667)
(3.0002492265568304)
(2.715641616833428)
(3.2405809024306187)
(2.178188511000776)
(2.406024396892179)
(4.434280312741692)
(0.9188810538477926)
(4.6933639757354175)
(0.238284772824934)
(3.2008238746252715)
(3.2456519438505174)
(0.833855542502468)
(4.6790885709431675)
(1.1899289200115644)
(6.2435219162544655)
(3.828492158431556)
(2.494833873743602)
(0.36525658741702766)
(3.5268998588918232)
(4.6257785562321185)
(4.627812929349562)
(5.734683411458594)
(0.3086581923792251)
(2.6342843306419956)
(5.242454951762288)
(6.042873003919572)
(0.4700200841999703)
(5.5044481845532225)
(5.361954808262137)
(2.2387235166305577)
(5.377559445650757)
(0.09317033927141105)
(0.8215685394656884)
(3.65932085851418)
(0.7101600031556637)
(0.5183003725930765)
(2.674950475377727)
(2.4295801392263026)
(2.2151734204933553)
(1.1016498121505545)
(5.3964282151248195)
(1.9766121824918597)
(4.815659126570763)
(4.834649872004941)
(5.381327296044731)
(4.124398988880843)
(6.152830561352026)
(0.7394211056913643)
(2.734636227366272)
(3.4326148252362363)
(3.0500968269301993)
(3.008089138666273)
(2.544947620014999)
(4.013474616774358)
(5.230983767813597)
(0.2874317303382005)
(4.227651055694033)
(1.760511773884034)
(0.14181081398612097)
(2.972987309163157)
(5.638160762183325)
(3.733672162242071)
(4.879222316028844)
(4.482636780914454)
(2.0983307434785026)
(4.802843691234722)
(5.205065797805466)
(4.241340998193498)
(4.7316482132239495)
(2.18491356662049)
(4.338127630803833)
(4.3798177772648454)
(5.9977388099449565)
(2.615127139673852)
(5.434363712335411)
(5.689703962565182)
(3.253509406610127)
(1.8088067329865103)
(3.616342901247315)
(3.9332169413413727)
(3.579092478053607)
(5.586676733517118)
(1.4356852468563215)
(2.688994716292109)
(0.7354315381469404)
(5.670091648673391)
(2.1029463396609764)
(2.4124590741888645)
(2.917773317026802)
(4.075054345525994)
(0.40047355288174696)
(4.132076222424719)
(0.73597375522121)
(4.739550600653917)
...
    );

    waveDirs
    1000
    (
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
(0.0)
...
    );

}

outlet
{

    alpha            alpha.water;

    waveModel        shallowWaterAbsorption;

    nPaddle          1;
}
