Tutoriels/interFoam/debitFranchissement/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actuel2_canal_directionZ.stl
{
	extractionMethod    extractFromSurface;

	extractFromSurfaceCoeffs
	{
		includedAngle 150;
	}

	subsetFeatures
	{
		nonManifoldEdges	yes;
		openEdges		yes;
	}
	

	writeObs yes;
}




// ************************************************************************* //
